Term4/matan/lectures/7.tex
% Created 2021-03-29 Mon 13:08
% Intended LaTeX compiler: pdflatex

  \documentclass[english]{article}
  \usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}
  
  \usepackage{geometry}
  \geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
   \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}
\usetikzlibrary{automata, arrows}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\newcommand{\todo}{{\color{red}\fbox{\text{Доделать}}}}
\newcommand{\fixme}{{\color{red}\fbox{\text{Исправить}}}}

\newcounter{propertycnt}
\setcounter{propertycnt}{1}
\newcommand{\beginproperty}{\setcounter{propertycnt}{1}}

\theoremstyle{plain}
\newtheorem{propertyinner}{Свойство}
\newenvironment{property}{
  \renewcommand\thepropertyinner{\arabic{propertycnt}}
  \propertyinner
}{\endpropertyinner\stepcounter{propertycnt}}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 7}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 7},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\newcommand{\X}{\chi}
\newcommand{\A}{\mathfrak{A}}
\newcommand{\B}{\mathfrak{B}}
\newcommand{\M}{\mathfrak{M}}

\section{Принцип Кавальери}
\label{sec:orgc4b2462}
\begin{enumerate}
\item \(C_x\) --- имзмерима при почти всех \(x\)
\item \(x \mapsto \nu C_x\) --- измерима*
\item \(mC = \int\limits_X \mathcal{X}_x d\mu\)
\end{enumerate}
\begin{corollary}
\(f: [a, b] \to \R\) --- непрерывная \\
\uline{Тогда} \(\int\limits_a^b f(x)\,dx = \int\limits_{[a, b]} f\,d\lambda_1\)
\end{corollary}
\begin{proof}
\(f>0\ \text{ПГ}(f[a, b])\) --- измеримое множество в \(\R^2\). \(C_x = [0, f(x)]\ \lambda_1(C_x) = f(x)\)
\[ \int\limits_a^b f(x)\, dx = \lambda_2(\text{ПГ}) = \int\limits_{[a, b]} f d\lambda_1 \]
\end{proof}
\begin{remark}
\(\lambda_2\) можно продолжить на множество \(2^{\R^2}\) с сохранением свойства конечной аддитивности и это продолжение не единственно
\label{orgee4b765}
\end{remark}
\begin{remark}
\(\lambda_m, m>2\) --- аналогичным образом продолжить невозможно. Парадокс Хаусдорфа-Банаха-Тарского
\label{orga188732}
\end{remark}
\begin{remark}
Для \hyperref[orgee4b765]{замечания 1} и \hyperref[orga188732]{замечания 2} требуется инвариантность меры относительно движения \(\R^m\)
\end{remark}

\begin{definition}
\-
\begin{itemize}
\item \(C \subset X \times Y\)
\item \(f: X \times T \to \Y\)
\item \(\forall x \in X\ f_x\) --- это функция(сечение) \(f_x(y) = f(x, y)\), можно считать что она задана на \(C_x\)
\item \(f^y\) --- аналогичное сечение
\end{itemize}
\end{definition}
\begin{theorem}
\-
\begin{itemize}
\item \((X, \A, \mu)\)
\item \((Y, \B, \nu)\)
\item \(\mu, \nu\) --- \(\sigma\)-конечныемера, полные
\item \(m = \mu x \nu\)
\item \(f: X \times Y \to \overline{R}, f \ge 0\) --- измерима относительно \(A\otimes B\)
\end{itemize}
\uline{Тогда}
\begin{enumerate}
\item при  почти всех \(x\) \(f_x\) --- измеримая на \(Y\) \color{blue}\(f^y\) --- измерима на \(X\) почти везде\color{black}
\item \(x \mapsto \varphi(x)=\int\limits_Y f_x d\nu = \int\limits_Y f(x, y) = d\nu(y)\) --- измеримая* на \(X\) \\
\color{blue}\(y \mapsto \psi(y) = \int\limits_X f^y d\mu\) --- измеримая* на \(Y\)\color{black}
\item \(\int\limits_{X \times Y} d fm = \int\limits_X \varphi d\mu = \int\limits_X\left(\int\limits_Y f(x, y) d\nu(y)\right)d\mu(x)\) \\
\color{blue}\(= \int\limits_Y \psi d\nu = \int\limits_Y\left(\int\limits_X f(x, y) d\mu(x)\right)d\nu(y)\)
\end{enumerate}
\end{theorem}
\begin{proof}
\todo
\end{proof}
\begin{corllary}
\(C \subset X \times Y\) \(P_1(C)\) --- измеримо. \\
\uline{Тогда} \[ \int\limits_C f dm = \int\limits_{f_1(C)}\left(\int_{C_x} f(x, y) d\nu(y)\right)d\mu(x) \]
\end{corllary}
\begin{theorem}[Фубини]
\-
\begin{itemize}
\item \((X, \A, \mu)\)
\item \(Y, B, \nu\)
\item \(\nu, mu\) --- \(\sigma\)-конечные
\item \(m = \nu \times \mu\)
\item \(f\) --- суммируема на \(X \times Y\) относительно \(m\)
\end{itemize}
\uline{Тогда}
\begin{enumerate}
\item \(f_x\) --- суммируема на \(Y\) при почти всех \(x\)
\item \(x \mapsto \varphi(x) = \int_Y fx\,d\nu = \int_Y f(x, y)\,d\nu(y)\) --- суммируема на \(Y\)
\item \(\int\limits_{X \times Y} f\,dm = \int\limits_X \varphi\,d\mu = \int_X \left(\int_Y f(x, y) d\nu(y)\right) d\mu(x)\)
\end{enumerate}
\end{theorem}
\begin{proof}
\color{green}Без доказательства\color{black}
\end{proof}
\todo
\section{Поверхностные интегралы}
\label{sec:org44c988e}
\subsection{Поверхностные интегралы I рода}
\label{sec:orgb406915}
\begin{definition}
\(M \subset \R^3\) --- простое двумерное гладкое многообразие. \(\varphi: G \subset \R^2 \to \R^3\) --- параметризация. \(E \subset M\) --- измеримо по Лебегу, если \(\varphi^{-1}(E)\) измеримо в \(\R^2\) по Лебегу
\end{definition}
\begin{symb}
\(\A_M = \{E \subset M | E\text{ --- измеримо}\} = \{\varphi(A) | A \in \M^2,\ A \subset G\}\)
\end{symb}
\begin{definition}
Мера на \(\A_M\) \[S(E) := \iint\limits_{\varphi^{-1}(E)} | \varphi'_u \times \varphi'_v |\,dudv\]
Т.е. это взвешенный образ меры Лебега при отображении \(\varphi\)
\end{definition}
\begin{remark}
\(\A_M\) --- \(\sigma\)-алгебра, \(S\) --- мера
\end{remark}
\begin{remark}
\(E \subset M\) --- компактное \(\Rightarrow\ \varphi^{-1}(E)\) --- компактное \(\Rightarrow\) измеримое \(\Rightarrow\) замкнутые множества измеримы \(\Rightarrow\) (относительно) открытые множества измеримы
\end{remark}
\begin{remark}
\(\A_M\) не зависит от \(\varphi\) по теореме о двух параметризациях
\end{remark}
\begin{remark}
\(S\) не зависит от \(\varphi\)
\[ |\overline{\varphi'_s}\times\overline{\varphi'_v}| = |(\overline{\varphi'_s}\cdot u'_s + \overline{\varphi'_v}\cdot v'_s) \times (\overline{\varphi'_u}\cdot u'_t + \overline{\varphi'_v}\cdot v'_t)| = \]
\[ = | \overline{(\varphi'_u \times \varphi'_v)}\cdot(u'_s\cdot v'_t - v'_s\cdot u'_t)| = \todo \]
\end{remark}
\begin{remark}
\-
\begin{itemize}
\item \(f: \M \to \overline{R}\) --- измеримая
\end{itemize}
\(M(f<a)\) --- измеримая \(\Leftrightarrow\) \(N(f\circ\varphi<a)\) --- измерима относително \(\M^2\) \\
\(f\) --- измерима относительно \(\A_M\) \(\Leftrightarrow\) \(f \circ \varphi\) --- измерима относительно \(\M^2\)
\end{remark}
\begin{definition}[поверхностный интеграл I рода]
\-
\begin{itemize}
\item \(M\) --- простое гладкое двумерное иногообразие в \(\R^3\)
\item \(\varphi\) --- параметризация
\item \(f: M \to \overline{R}\) --- суммируема по мере \(S\)
\end{itemize}
То \[ \iint\limits_M f\,ds = \iint\limits_M f(x, y, z)\,ds \]
называется \textbf{интегралом I рода от \(f\) по многообразию \(M\)}
\end{definition}
\begin{remark}
По теореме об интегрировании по взвешенному образу меры
\[ \iint\limits_M f\,ds = \iint\limits_G f(\varphi(u, v)) |\varphi'_v \times \varphi'_v|\,dudv \]
\[ \varphi'_u \times \varphi'_v = \begin{pmatrix}
i & x'_u & x'_v \\
j & y'_u & y'_v \\
k & z'_u & z'_v
\end{pmatrix}\]
\[ |\varphi'_u \times \varphi'_v| = |\varphi'_u| \cdot |\varphi'_v|\sun\alpha = \sqrt{|\varphi'_u|^2 \cdot |varphi'_v|^2 \cdot (1 - \cos^2\alpha)} = \sqrt{EG - F^2} \]
\[ E = |\varphi'_u| = x'_u^2 + y'_u^2 + z'_u^2 \]
\[ F = \langle \varphi'_u, \varphi'_v \rangle = x'_ux'_v + y'_uy'_v + z'_u z'_v \quad F = |\varphi'_v|^2 \]
\end{remark}
\end{document}
